# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าจอดรถ
# Input: จำนวนชั่วโมงที่จอด (จำนวนเต็ม)
# Output: ค่าจอดรถ (0, 20 หรือ 50)
# เงื่อนไข: ไม่เกิน 1 ชั่วโมง จ่าย 0 | 2-4 ชั่วโมง จ่าย 20 | เกิน 4 ชั่วโมง จ่าย 50
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดน
hour = int(input(1))
if hour = int(input(ไม่เกิน 1 ชั่วโมง))
      print ("0")
if ้่้้hour = int(input(2-4))
      print ("20")
if hour = int(input(เกิน 4 ชั่วโมง))
      print ("50")
eles :
      print ("0")
